Repository: Stormbase/wagtail-mfa
Catalog: src/wagtail_mfa/locale/*/LC_MESSAGES/django.po
Languages: nl

source: Nickname
nl: Naam

source: Give this Passkey a memorable name. This will help you identify it later.
nl: Geef deze Passkey een herkenbare naam. Dit helpt je om deze later te identificeren.

source: Name contains invalid characters.
nl: Naam bevat ongeldige tekens.

source: Registered MFA devices
nl: Geregistreerde MFA-apparaten

source: Multi Factor Authentication Settings
nl: Meerstapsverificatie-instellingen

source: Manage your authentication settings
nl: Beheer je authenticatie-instellingen

source: (unnamed device)
nl: (naamloos apparaat)

source: Passkeys allow you to verify your identity using touch, facial recognition, a device password, or a PIN. They can be used for sign-in as a simple and secure alternative to your password and two-factor credentials.
nl: Passkeys stellen je in staat om je identiteit te verifiëren met behulp van vingerafdrukscan, gezichtsherkenning, een apparaatwachtwoord of een pincode. Ze kunnen worden gebruikt voor inloggen als een eenvoudig en veilig alternatief voor je wachtwoord en tweestapsverificatiegegevens.

source: Your passkeys
nl: Jouw passkeys

source: Add Passkey
nl: Passkey toevoegen

source: This Passkey indicates it has been backed up
nl: Deze Passkey geeft aan dat deze is geback-upt

source: Synced
nl: Gesynchroniseerd

source: Added on %(created_at_date)s.
nl: Toegevoegd op %(created_at_date)s.

source: Last used: %(last_used_at_naturaltime)s
nl: Laatst gebruikt: %(last_used_at_naturaltime)s

source: Last used: never
nl: Laatst gebruikt: nooit

# verb, action
source: Edit
nl: Bewerk

# verb, action
source: Delete
nl: Verwijder

source: Authenticate with Passkeys
nl: Authenticeer met Passkeys

source: Get started with Passkeys
nl: Aan de slag met Passkeys

source: Create new passkey
nl: Nieuwe passkey aanmaken

source: Sign in using Passkeys
nl: Log in met Passkeys

source: Your device supports passkeys, a password replacement that validates your identity using touch, facial recognition, a device password, or a PIN. Passkeys can be used for sign-in as a simple and secure alternative to your password and two-factor credentials.
nl: Je apparaat ondersteunt passkeys, een wachtwoordvervanger die je identiteit valideert met behulp van vingerafdrukscan, gezichtsherkenning, een apparaatwachtwoord of een pincode. Passkeys kunnen worden gebruikt voor inloggen als een eenvoudig en veilig alternatief voor je wachtwoord en tweestapsverificatiegegevens.

source: Register Passkey
nl: Registreer Passkey

source: Back to overview
nl: Terug naar overzicht

source: Sorry, your browser does not have Passkey support. You cannot register a Passkey using this browser. Try using a different browser or device.
nl: Sorry, je browser ondersteunt geen Passkeys. Je kunt geen Passkey registreren met deze browser. Probeer een andere browser of apparaat.

source: Delete Passkey
nl: Verwijder Passkey

source: Delete passkey “%(device_name)s”?
nl: Verwijder passkey “%(device_name)s”?

source: Are you sure you want to delete this passkey? When you remove this passkey, you will no longer be able to use it to sign in.
nl: Weet je zeker dat je deze passkey wilt verwijderen? Wanneer je deze passkey verwijdert, kun je deze niet langer gebruiken om in te loggen.

source: Note: you may still see this passkey as an option to sign in until you also remove it from your browser, device or password manager.
nl: Opmerking: je kunt deze passkey nog steeds zien als een optie om in te loggen totdat je deze ook verwijdert uit je browser, apparaat of wachtwoordmanager.

source: Alter Passkey
nl: Wijzig Passkey

source: Update passkey
nl: Passkey aanpassen

source: Save changes
nl: Wijzigingen opslaan

source: Sign in using a Passkey
nl: Log in met een Passkey

source: Your passkey was created successfully! Now, please give it a name.
nl: Je passkey is opgeslagen! Geef er nu alsjeblieft een naam aan.

source: Passkey saved successfully.
nl: Passkey opgeslagen.

source: Passkey “%(device_name)s“ deleted successfully
nl: Passkey “%(device_name)s“ verwijderd

source: Manage authentication settings
nl: Beheer je authenticatie instellingen

source: Manage your multi-factor authentication settings.
nl: Beheer je meerstapsverificatie-instellingen.
